{
  "version": "https://jsonfeed.org/version/1",
  "title": "Artwork \u0026 Process on Simon Peng 🐒",
  "icon": "https://avatars.micro.blog/avatars/2024/10/1583545.jpg",
  "home_page_url": "http://localhost:1313/",
  "feed_url": "http://localhost:1313/feed.json",
  "items": [
      {
        "id": "http://simonpeng.micro.blog/2025/01/27/we-have-to-stop-pretending.html",
        
        "content_html": "<p><a href=\"https://www.everyonescreative.net/p/we-have-to-stop-pretending-creativity\">We have to stop pretending creativity is &ldquo;magic.&rdquo;</a>\nI feel like the only way to build solidarity for creative labour is by sharing your process and making it clear that you <strong>aren’t</strong> magically talented.</p>\n<p>#art #creativity #process</p>\n",
        "date_published": "2025-01-27T11:07:51-04:00",
        "url": "http://localhost:1313/2025/01/27/we-have-to-stop-pretending.html",
        "tags": ["Creative Industry","Artwork \u0026 Process"]
      },
      {
        "id": "http://simonpeng.micro.blog/2024/07/18/ai-isnt-god.html",
        "title": "AI isn’t God - A bit about absurdity and highlighting contrasts.",
        "content_html": "<p>A few weeks ago I published a piece about how <a href=\"https://www.everyonescreative.net/p/ai-companies-think-youre-stupid\">AI is showing up in everything, even Adobe Acrobat.</a> It’s now well beyond ridiculous, and the one thing I didn’t articulate with words but explored a bit with visuals is the absolutely hilarious way that AI is elevated to this omnipotent, god-like status &ndash; it’s something so powerful and dangerous that we don’t understand how incredible it is &ndash; but then we use it to do some of the most mundane, trivial shit. It’s like asking Jesus to put together your IKEA for you.</p>\n<p><img src=\"https://simonpeng.net/uploads/2024/image.jpg\" alt=\"\"></p>\n<p><a href=\"https://emilygorcenski.com/post/making-god/\">People much smarter than me</a> have pointed out how AI evangelists speak about “AGI” (Artificial <em>General</em> Intelligence) and technology in general with a fully religious fervour. It’s part of what is so off-putting about AI tools to me. Like Web3, crypto, NFTs and basically any other cyber-cult there’s this uncritical dogma circling AI that forces you to accept certain things as fact before you can even join the conversation. And I just don’t. It doesn’t follow, to me, that a sufficiently complex auto-complete text generator will somehow ascend toward full god-level intelligence. I don’t believe it. And because I don’t believe <em>that</em> everything that follows is just impossible to believe.</p>\n<p>Conversely, the people that <em>do</em> accept the dogma now have a solid logical framework for everything else to build off of. It makes perfect sense that every business will want to integrate AI into their products and their workflows &ndash; who wouldn’t want a GOD on their side?</p>\n<p>This is where the absurdity of the comparison slots into place for me. I just don’t get how we can ask god to do our homework for us. I don’t understand how it seems like a good use of a cyber-deity to summarize an email for you. It reminds me of when I watch Survivor and people are <em>praying to god</em> to save them from being voted out. Is that a good use of your god’s infinite, transcendent power and influence? To keep you on a game show?</p>\n<p>Anyways, this whole rant was just meant to set up the rationale behind the images I made to go with that recent post. I discovered <a href=\"https://publicdomainreview.org/collection/passio-verbigenae/\">these amazing prints on The Public Domain Review</a> and when I thought of contrasting them with the meaningless word trash Adobe created to promote Acrobat AI, it felt too funny not to try it out.</p>\n<p><img src=\"https://simonpeng.net/uploads/2024/df0a9413a6.jpg\" alt=\"\"></p>\n<p><img src=\"https://simonpeng.net/uploads/2024/20f1a3b965.jpg\" alt=\"\"></p>\n<p><img src=\"https://simonpeng.net/uploads/2024/f5809fa12b.jpg\" alt=\"\"></p>\n<p><img src=\"https://simonpeng.net/uploads/2024/b6034a8575.jpg\" alt=\"\"></p>\n<p><img src=\"https://simonpeng.net/uploads/2024/c31d2d9d7c.jpg\" alt=\"\"></p>\n<p><img src=\"https://simonpeng.net/uploads/2024/7e7e5b2dc6.jpg\" alt=\"\"></p>\n<p><img src=\"https://simonpeng.net/uploads/2024/a06689ba5c.jpg\" alt=\"\"></p>\n<p>I really love how lame the marketing language looks when you pair it with literal biblical imagery.</p>\n<p>Working on <em>Everyone’s Creative</em> has been interesting in how it’s helped me widen what I let myself create for the newsletter. Before, when it was still <em>Robot Fan Club</em> it felt very closely tied to my identity as an illustrator. I felt a real pressure (from myself) to draw a lot of the imagery I used to support the writing. Sometimes it worked really well! Sometimes I was clearly less into it. With this new name and framing, though, I feel way more free to play with design, collage, typography and visual metaphor in a way that has been a lot of fun. The visual identity that is growing around <em>Everyone’s Creative</em> is really energizing me.</p>\n<p>I’m looking forward to experimenting more with the art I make for EC. It feels like a new “era” for my work and I feel so much more excited about making things recently than I have in a long time. Turns out I like novelty!</p>",
        "date_published": "2024-07-18T12:29:28-04:00",
        "url": "http://localhost:1313/2024/07/18/ai-isnt-god.html",
        "tags": ["Update","Artwork \u0026 Process"]
      }
  ]
}
